benchmarks.txt
Apache Run, STAGE 2:

titof@Tito-sLaptop:/mnt/c/Windows/system32$ ab -n 1000 -c 10 http://127.0.0.1:8080/
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      10
Time taken for tests:   4.388 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      638000 bytes
HTML transferred:       554000 bytes
Requests per second:    227.89 [#/sec] (mean)
Time per request:       43.880 [ms] (mean)
Time per request:       4.388 [ms] (mean, across all concurrent requests)
Transfer rate:          141.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   43   4.3     43      63
Waiting:        4   43   4.4     43      63
Total:          5   44   4.3     43      63

Percentage of the requests served within a certain time (ms)
  50%     43
  66%     44
  75%     45
  80%     45
  90%     47
  95%     51
  98%     55
  99%     58
 100%     63 (longest request)

NGINX Run, STAGE 2:

titof@Tito-sLaptop:/mnt/c/Users/Teets/OneDrive/Desktop/WebServerProject$ ab -n 1000 -c 10 http://127.0.0.1/
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.28.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /
Document Length:        554 bytes

Concurrency Level:      10
Time taken for tests:   0.239 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      796000 bytes
HTML transferred:       554000 bytes
Requests per second:    4184.21 [#/sec] (mean)
Time per request:       2.390 [ms] (mean)
Time per request:       0.239 [ms] (mean, across all concurrent requests)
Transfer rate:          3252.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      1       3
Processing:     0    1   0.6      1       5
Waiting:        0    1   0.5      1       5
Total:          1    2   0.6      2       6

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      3
  98%      5
  99%      6
 100%      6 (longest request)